import './style.scss'

//console.log('121')
//console.log('1233')

//console.log(typeof 12)
//console.log(typeof '12')
//console.log(typeof true)
//console.log(typeof false)
//console.log(typeof [])
//console.log(1>2)
//console.log(1<2)

//let year = 2015
//if (year==2015){
 // console.log('yes') 
//} else{
 // console.log('no')
//}

//let value = prompt('Введите число', 0);

//if (value > 0) {
  //alert( 1 );
//} else if (value < 0) {
 // alert( -1 );
//} else {
 // alert( 0 );
//}

//result = (a + b < 4) ? 'Мало' : 'Много';

 
  //let message = (login == 'Сотрудник') ? 'Привет' :
 // (login == 'Директор') ? 'Здравствуйте' :
  //(login == '') ? 'Нет логина' :
  //'';

  let a 
  console.log(a)
  a=34*212*122*13
  console.log(a)
  // let b=+(prompt('Введите число','0') as string)
  // console.log(b)

  console.log(parseInt('12.5dfgdf12'))
  console.log(parseFloat('12.5dfgdf'))
  console.log(+'12.5dfgdf')
  console.log(+'12.5')
  
  // Запросите у пользователя 2 числа и выведите среднее арифметическое этих чисел.
  let n1 =5
  let n2 =10 
  console.log((n1+n2)/2)
  
  // Запросите у пользователя длину стороны квадрата и выведите площадь такого квадрата.
  let n =5
  console.log(n*2)
  // Реализуйте конвертор из километров в мили (пользователь вводит километры, программа выводит мили). 1 км = 0,621371 миль. Это значение укажите в коде как константу.
  let km = 30
  const KM_IN_MILE = 0.621371
  console.log(km*KM_IN_MILE)
  
  // Реализуйте калькулятор. Пользователь вводит два числа,а программа выводит результаты действий + - * / междуэтими числами.
  let d =5
  let f =20
  console.log(d+f)
  console.log(d-f)
  console.log(d*f)
  
  // Пользователь вводит значения a и b для формулы a * x + b = 0,а программа считает и выводит значение x.
  d = 456
  f =34567
  console.log(-f/d)
  
  // Запросите у пользователя текущее время (часы и минуты) и выведите, сколько часов и минут осталось до следующего дня
  let hour =2
  let minuts =37
  console.log((24-hour),(60-minuts))
  console.log((24-hour),(60-minuts))
  
  // Зарплата работника составляет $250 + 10% от продаж.Запросите общую сумму продаж за месяц и посчитайте зарплату.
  let prodal = 600
  console.log(250+(prodal*10/100))
 
  
  // Запросите у пользователя его имя и выведите в ответ: «Привет, его имя!».
  let user
  user = 'Семён';
  console.log('Привет,',user, '!')
  // Запросите у пользователя год его рождения, посчитайте,сколько ему лет и выведите результат. Текущий год укажитев коде как константу.
  let yy =1996
  const toDay =2024
  console.log(toDay-yy)
  
  // Запросите у пользователя длину стороны квадрата и выведите периметр такого квадрата.
  let storona =35
  console.log(storona*4)
  // Запросите у пользователя радиус окружности и выведите площадь такой окружности.
  let radius =6
  const pi =3.14
  console.log(radius*radius*pi)
  // Запросите у пользователя расстояние в км между двумя городами и за сколько часов он хочет добраться. Посчитайте скорость, с которой необходимо двигаться, чтобы успеть вовремя.
  km =856
  hour =12
  console.log(km/hour)
  // Реализуйте конвертор валют. Пользователь вводит доллары, программа переводит в евро. Курс валюты храните в константе.
  const euro =0.923773
  let dollar =48
  console.log(dollar*euro)
  // Пользователь указывает объем флешки в Гб. Программа должна посчитать сколько файлов размером в 820 Мб помещается на флешку.
  let gb = 34
  const MB_IN_GB =1024
  console.log(gb*MB_IN_GB/820)
  // Пользователь вводит сумму денег в кошельке и цену одной шоколадки. Программа выводит сколько шоколадок может купить пользователь и сколько сдачи у него останется.
  let summa = 113
  let shoko =13
  console.log("Вы можете купить",summa/shoko)
  console.log("Ваша здача составит", summa - shoko*(summa/shoko))
  //  как посчитать сдачу??????
  





  

 


 
